app/controllers/access_controller.rb

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."username" = ?  ORDER BY "admin_users"."id" ASC LIMIT 1  [["username", "waihon03"]]
---
  def attempt_login
    if params[:username].present? && params[:password].present?
      found_user = AdminUser.where(:username => params[:username]).first