app/controllers/admin_users_controller.rb

INSERT INTO "admin_users" ("first_name", "last_name", "email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @admin_user = AdminUser.new(admin_user_params)
    if @admin_user.save

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @admin_user = AdminUser.find(params[:id])

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "admin_users" SET "first_name" = ?, "last_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "admin_users"."id" = ?  [["first_name", "Yew"], ["last_name", "Serwan"], ["password_digest", "$2a$10$uKNg9/35e/Y6PUBtus4Ir.o9a.NAtYeatOAs1AEj6WDrdCqzaNiQe"], ["updated_at", "2015-06-19 00:12:28.635501"], ["id", 6]]
---
  def update
    @admin_user = AdminUser.find(params[:id])
    #if @admin_user.update(admin_user_params)
    if @admin_user.update_attributes(admin_user_params)

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", 3]]
---
  def delete
    @admin_user = AdminUser.find(params[:id])

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "admin_users" WHERE "admin_users"."id" = ?  [["id", 5]]
---
  def destroy
    @admin_user = AdminUser.find(params[:id])
    if @admin_user.destroy