app/controllers/subjects_controller.rb

  def show
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM "subjects"

  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save
---
INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rails Model"], ["position", 1], ["visible", "t"], ["created_at", "2015-06-17 00:59:00.000000"], ["updated_at", "2015-06-17 00:59:45.526673"]]

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "subjects"

  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

  def delete
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]